apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
/****************************************************************************
 * arch/renesas/src/rx65n/rx65n_eth.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#if defined(CONFIG_NET) && defined(CONFIG_RX65N_EMAC)

#include <inttypes.h>
#include <stdint.h>
#include <stdbool.h>
#include <time.h>
#include <string.h>
#include <assert.h>
#include <nuttx/debug.h>
#include <errno.h>

#include <arpa/inet.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/queue.h>
#include <nuttx/wqueue.h>
#include <nuttx/net/phy.h>
#include <nuttx/net/mii.h>
#include <nuttx/net/ip.h>
#include <nuttx/net/netdev.h>
#include <nuttx/spinlock.h>

#if defined(CONFIG_ARCH_PHY_INTERRUPT)
#  include <nuttx/net/phy.h>
#endif

#if defined(CONFIG_NET_PKT)
#  include <nuttx/net/pkt.h>
#endif

#include "renesas_internal.h"
#include "chip.h"
#include "rx65n_definitions.h"
#include "rx65n_eth.h"
#include "rx65n_cmt.h"
#include "rx65n_cmtw.h"
#include "rx65n_cmtw0.h"

#include <arch/board/board.h>
#include <arch/board/rx65n_gpio.h>

#if RX65N_NETHERNET > 0

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#if RX65N_NETHERNET > 1
#  error "Logic to support multiple Ethernet interfaces is incomplete"
#endif

#define RX65N_EMAC0_DEVNAME "eth0"

/* Work queue support is required. */

#if !defined (CONFIG_SCHED_WORKQUEUE)
#  error Work queue support is required
#endif

/* The low priority work queue is preferred.  If it is not enabled, LPWORK
 * will be the same as HPWORK.
 *
 * NOTE:  However, the network should NEVER run on the high priority work
 * queue!  That queue is intended only to service short back end interrupt
 * processing that never suspends.  Suspending the high priority work queue
 * may bring the system to its knees!
 */

#define ETHWORK LPWORK

#ifndef CONFIG_RX65N_EMAC0_PHYADDR
#  error "CONFIG_RX65N_EMAC0_PHYADDR must be defined in the NuttX configuration"
#endif

#if !defined(CONFIG_RX65N_EMAC0_MII) && !defined(CONFIG_RX65N_EMAC0_RMII)
#  warning "Neither CONFIG_RX65N_EMAC0_MII nor CONFIG_RX65N_EMAC0_RMII defined"
#endif

#if defined(CONFIG_RX65N_EMAC0_MII) && defined(CONFIG_RX65N_EMAC0_RMII)
#  error "Both CONFIG_RX65N_EMAC0_MII and CONFIG_RX65N_EMAC0_RMII defined"
#endif

#ifdef CONFIG_RX65N_EMAC0_AUTONEG
#  ifndef CONFIG_RX65N_EMAC0_PHYSR
#    error "CONFIG_RX65N_EMAC0_PHYSR must be defined in the NuttX configuration"
#  endif
#  ifdef CONFIG_RX65N_EMAC0_PHYSR_ALTCONFIG
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_ALTMODE
#      error "CONFIG_RX65N_EMAC0_PHYSR_ALTMODE must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_10HD
#      error "CONFIG_RX65N_EMAC0_PHYSR_10HD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_100HD
#      error "CONFIG_RX65N_EMAC0_PHYSR_100HD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_10FD
#      error "CONFIG_RX65N_EMAC0_PHYSR_10FD must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_100FD
#      error "CONFIG_RX65N_EMAC0_PHYSR_100FD must be defined in the NuttX configuration"
#    endif
#  else
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_SPEED
#      error "CONFIG_RX65N_EMAC0_PHYSR_SPEED must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_100MBPS
#      error "CONFIG_RX65N_EMAC0_PHYSR_100MBPS must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_MODE
#      error "CONFIG_RX65N_EMAC0_PHYSR_MODE must be defined in the NuttX configuration"
#    endif
#    ifndef CONFIG_RX65N_EMAC0_PHYSR_FULLDUPLEX
#      error "CONFIG_RX65N_EMAC0_PHYSR_FULLDUPLEX must be defined in the NuttX configuration"
#    endif
#  endif
#endif

/* This driver does not use enhanced descriptors.  Enhanced descriptors must
 * be used, however, if time stamping and/or IPv4 checksum offload is
 * supported.
 */

#undef CONFIG_RX65N_ETH_ENHANCEDDESC
#undef CONFIG_RX65N_ETH_HWCHECKSUM

/* Add 4 to the configured buffer size to account for the 2 byte checksum
 * memory needed at the end of the maximum size packet.  Buffer sizes must
 * be an even multiple of 4, 8, 16 or 32bytes (depending on buswidth).  We
 * will use the 32-byte alignment in all cases.
 */

#define OPTIMAL_ETH_BUFSIZE ((CONFIG_NET_ETH_PKTSIZE + 4 + 31) & ~31)

#ifndef CONFIG_RX65N_ETH_BUFSIZE
#  define CONFIG_RX65N_ETH_BUFSIZE OPTIMAL_ETH_BUFSIZE
#endif

#if (CONFIG_RX65N_ETH_BUFSIZE & 31) != 0
#  error "CONFIG_RX65N_ETH_BUFSIZE must be aligned"
#endif

#if CONFIG_RX65N_ETH_BUFSIZE != OPTIMAL_ETH_BUFSIZE
#  warning "You using an incomplete/untested configuration"
#endif

#ifndef CONFIG_RX65N_ETH_NRXDESC
#  define CONFIG_RX65N_ETH_NRXDESC 16
#endif
#ifndef CONFIG_RX65N_ETH_NTXDESC
#  define CONFIG_RX65N_ETH_NTXDESC 12
#endif

/* We need at least one more free buffer than transmit buffers */

#define RX65N_ETH_NFREEBUFFERS (CONFIG_RX65N_ETH_NTXDESC+1)

