apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
/* Extremely detailed register debug that you would normally never want
 * enabled.
 */

#ifndef CONFIG_DEBUG_NET
#  undef CONFIG_RX65N_EMAC_REGDEBUG
#endif

/* Helpers */

/* This is a helper pointer for accessing the contents of the Ethernet
 * header
 */

#define BUF ((struct eth_hdr_s *)&priv->dev.d_buf[0])

/* PHY return definitions */

#define R_PHY_OK        (0)
#define R_PHY_ERROR     (-1)

#define ETHER_FLAG_OFF   (0)

/* PHY Mode Selection */

#define PHY_MII_SET_MODE        (0)
#define PHY_RMII_SET_MODE       (1)

/* Pause frame disable/enable */

#define PAUSE_FRAME_DISABLE             (0)
#define PAUSE_FRAME_ENABLE              (1)

/* Media Independent Interface */

#define PHY_MII_ST                      (1)
#define PHY_MII_READ                    (2)
#define PHY_MII_WRITE                   (1)

/* Define the access timing of MII/RMII register */

#define ETHER_CFG_PHY_MII_WAIT                      (8)     /* define the value of 1 or more */

/* Define the waiting time for reset completion of PHY-LSI */

#define ETHER_CFG_PHY_DELAY_RESET                   (0x00020000L)
#define ETHER_PHY_STATUS_CHECK_DELAY                (20000)

/* Group AL1 interrupt priority level.
 * This definition is not used when EINT interrupt
 * is assigned to Peripheral
 * interrupt.
 */

#define ETHER_CFG_AL1_INT_PRIORITY                  (15)

/* Use LINKSTA signal for detect link status changes
 * 0 = unused  (use PHY-LSI status register)
 * 1 = use     (use LINKSTA signal)
 */

/* This setting is reflected in all channels */

#define ETHER_CFG_USE_LINKSTA           (1)

#define ETHER_LINKUP                    (1)
#define ETHER_LINKDOWN                  (0)

/* Multicast filter */

#define ETHER_MC_FILTER_OFF             (0) /* Multicast frame filter disable */
#define ETHER_MC_FILTER_ON              (1) /* Multicast frame filter enable */

/* Standard PHY Registers */

#define PHY_REG_CONTROL                 (0)
#define PHY_REG_STATUS                  (1)
#define PHY_REG_IDENTIFIER1             (2)
#define PHY_REG_IDENTIFIER2             (3)
#define PHY_REG_AN_ADVERTISEMENT        (4)
#define PHY_REG_AN_LINK_PARTNER         (5)
#define PHY_REG_AN_EXPANSION            (6)

/* Phy Interrupt register */

#define PHY_REG_MICR (17)
#define PHY_REG_MISR (18)
#define PHY_MICR_TINT (1<<2)
#define PHY_MICR_INTEN (1<<1)
#define PHY_MICR_INT_OE (1<<0)
#define PHY_MISR_LINK_LQ_INT_EN (1<<7)
#define PHY_MISR_LINK_ED_INT_EN (1<<6)
#define PHY_MISR_LINK_INT_EN (1<<5)

/* Basic Mode Control Register Bit Definitions */

#define PHY_CONTROL_RESET               (1 << 15)
#define PHY_CONTROL_LOOPBACK            (1 << 14)
#define PHY_CONTROL_100_MBPS            (1 << 13)
#define PHY_CONTROL_AN_ENABLE           (1 << 12)
#define PHY_CONTROL_POWER_DOWN          (1 << 11)
#define PHY_CONTROL_ISOLATE             (1 << 10)
#define PHY_CONTROL_AN_RESTART          (1 << 9)
#define PHY_CONTROL_FULL_DUPLEX         (1 << 8)
#define PHY_CONTROL_COLLISION           (1 << 7)
#define PHY_VALID_LINK                  (1 << 2)
#define PHY_AUTO_NEG_DONE               (1 << 5)

/* Auto Negotiation Advertisement Bit Definitions */

#define PHY_AN_ADVERTISEMENT_NEXT_PAGE  (1 << 15)
#define PHY_AN_ADVERTISEMENT_RM_FAULT   (1 << 13)
#define PHY_AN_ADVERTISEMENT_ASM_DIR    (1 << 11)
#define PHY_AN_ADVERTISEMENT_PAUSE      (1 << 10)
#define PHY_AN_ADVERTISEMENT_100_T4     (1 << 9)
#define PHY_AN_ADVERTISEMENT_100F       (1 << 8)
#define PHY_AN_ADVERTISEMENT_100H       (1 << 7)
#define PHY_AN_ADVERTISEMENT_10F        (1 << 6)
#define PHY_AN_ADVERTISEMENT_10H        (1 << 5)
#define PHY_AN_ADVERTISEMENT_SELECTOR   (1 << 0)

/* Bit definitions of status member of DescriptorS */

#define  TACT               (0x80000000)
#define  TDLE               (0x40000000)
#define  RACT               (0x80000000)
#define  RDLE               (0x40000000)
#define  TFP1               (0x20000000)
#define  RFP1               (0x20000000)
#define  TFP0               (0x10000000)
#define  RFP0               (0x10000000)
#define  TFE                (0x08000000)
#define  RFE                (0x08000000)

#define  RFS9_RFOVER        (0x00000200)
#define  RFS8_RAD           (0x00000100)
#define  RFS7_RMAF          (0x00000080)
#define  RFS4_RRF           (0x00000010)
#define  RFS3_RTLF          (0x00000008)
#define  RFS2_RTSF          (0x00000004)
#define  RFS1_PRE           (0x00000002)
#define  RFS0_CERF          (0x00000001)

#define  TWBI               (0x04000000)
#define  TFS8_TAD           (0x00000100)
#define  TFS3_CND           (0x00000008)
#define  TFS2_DLC           (0x00000004)
#define  TFS1_CD            (0x00000002)
#define  TFS0_TRO           (0x00000001)

/* DMA descriptor buffer alignment to 32 bytes */

#define NX_ALIGN32 aligned_data(32)

/****************************************************************************
 * Public Variables
 ****************************************************************************/

/* Ethernet TX DMA Descriptor */

struct eth_txdesc_s
{
  /* Normal DMA descriptor words */

  volatile uint32_t tdes0;   /* Indicates transfer frame setting and the status after transmission */
  volatile uint32_t tdes1;   /* Used to set the valid byte length of the transmit buffer */
  volatile uint32_t tdes2;   /* Used to set the start address of transmit buffer */
  volatile uint32_t tdes3;   /* next descriptor address pointer */
};

/* Ethernet RX DMA Descriptor */

struct eth_rxdesc_s
{
  volatile uint32_t rdes0;   /* Indicates receive frame status */

  /* Indicates receive buffer length when reception is completed,
   * the receive frame length is return back
   */

  volatile uint32_t rdes1;
  volatile uint32_t rdes2;   /* Indicates the start address of  the receive buffer  */
  volatile uint32_t rdes3;   /* next descriptor address pointer */
};

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* The rx65n_ethmac_s encapsulates all state information for a single
 * hardware interface
 */

struct rx65n_ethmac_s
{
  /* Descriptor allocations */

  struct eth_rxdesc_s rxtable[CONFIG_RX65N_ETH_NRXDESC];
  struct eth_txdesc_s txtable[CONFIG_RX65N_ETH_NTXDESC];

  /* Buffer allocations */

  uint8_t rxbuffer[CONFIG_RX65N_ETH_NRXDESC*CONFIG_RX65N_ETH_BUFSIZE];
  uint8_t alloc[RX65N_ETH_NFREEBUFFERS*CONFIG_RX65N_ETH_BUFSIZE];
  uint8_t              ifup    : 1; /* true:ifup false:ifdown */
  uint8_t              mbps100 : 1; /* 100MBps operation (vs 10 MBps) */
  uint8_t              fduplex : 1; /* Full (vs. half) duplex */
  struct work_s        irqwork;     /* For deferring interrupt work to the work queue */
  struct work_s        pollwork;    /* For deferring poll work to the work queue */

  /* This holds the information visible to the NuttX network */

  struct net_driver_s  dev;         /* Interface understood by the network */

  /* Used to track transmit and receive descriptors */

  struct eth_txdesc_s *txhead;      /* Next available TX descriptor */
  struct eth_rxdesc_s *rxhead;      /* Next available RX descriptor */

  struct eth_txdesc_s *txtail;      /* First "in_flight" TX descriptor */
  struct eth_rxdesc_s *rxcurr;      /* First RX descriptor of the segment */
  uint16_t             segments;    /* RX segment count */
  uint16_t             inflight;    /* Number of TX transfers "in_flight" */
  sq_queue_t           freeb;       /* The free buffer list */

  uint32_t             prevlinkstatus; /* Previous link status to ignore multiple link change interrupt (specific to GR-Rose) */
  uint8_t              mc_filter_flag; /* Multicast filter */
  spinlock_t           lock;           /* SpinLock */
};

/****************************************************************************
 * Private Data
 ****************************************************************************/

