apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
NX_ALIGN32 static struct rx65n_ethmac_s g_rx65nethmac[RX65N_NETHERNET];

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

/* Register operations */

#if defined(CONFIG_RX65N_EMAC_REGDEBUG) && defined(CONFIG_DEBUG_FEATURES)
static uint32_t rx65n_getreg(uint32_t addr);
static void rx65n_putreg(uint32_t val, uint32_t addr);
static void rx65n_checksetup(void);
#else
#  define rx65n_getreg(addr)     getreg32(addr)
#  define rx65n_putreg(val,addr) putreg32(val,addr)
#  define rx65n_checksetup()
#endif

/* Debug */

/* Extra, in-depth debug output that is only available if
 * CONFIG_NETDEV_PHY_DEBUG us defined.
 */

#ifdef CONFIG_NETDEV_PHY_DEBUG
#  define phyerr    _err
#  define phywarn   _warn
#  define phyinfo   _info
#else
#  define phyerr(x...)
#  define phywarn(x...)
#  define phyinfo(x...)
#endif

/* Free buffer management */

static void rx65n_initbuffer(struct rx65n_ethmac_s *priv);
static inline uint8_t *rx65n_allocbuffer(struct rx65n_ethmac_s *priv);
static inline void rx65n_freebuffer(struct rx65n_ethmac_s *priv,
                                    uint8_t *buffer);
static inline bool rx65n_isfreebuffer(struct rx65n_ethmac_s *priv);

/* Common TX logic */

static int  rx65n_transmit(struct rx65n_ethmac_s *priv);
static int  rx65n_txpoll(struct net_driver_s *dev);
static void rx65n_dopoll(struct rx65n_ethmac_s *priv);

/* Interrupt handling */

static void rx65n_enableint(struct rx65n_ethmac_s *priv,
                            uint32_t ierbit);
static void rx65n_disableint(struct rx65n_ethmac_s *priv,
                             uint32_t ierbit);

static void rx65n_freesegment(struct rx65n_ethmac_s *priv,
                              struct eth_rxdesc_s *rxfirst, int segments);
static int  rx65n_recvframe(struct rx65n_ethmac_s *priv);
static void rx65n_receive(struct rx65n_ethmac_s *priv);
static void rx65n_freeframe(struct rx65n_ethmac_s *priv);
static void rx65n_txdone(struct rx65n_ethmac_s *priv);

static void rx65n_interrupt_work(void *arg);
static int  rx65n_interrupt(int irq, void *context, void *arg);

/* Timer expirations */

static void rx65n_txtimeout_work(void *arg);

/* NuttX callback functions */

static int  rx65n_ifup(struct net_driver_s *dev);
static int  rx65n_ifdown(struct net_driver_s *dev);

static void rx65n_txavail_work(void *arg);
static int  rx65n_txavail(struct net_driver_s *dev);

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static int  rx65n_addmac(struct net_driver_s *dev, const uint8_t *mac);
#endif
#ifdef CONFIG_NET_MCASTGROUP
static int  rx65n_rmmac(struct net_driver_s *dev, const uint8_t *mac);
#endif
#ifdef CONFIG_NETDEV_IOCTL
static int  rx65n_ioctl(struct net_driver_s *dev, int cmd,
                        unsigned long arg);
#endif

/* Descriptor Initialization */

static void rx65n_txdescinit(struct rx65n_ethmac_s *priv);
static void rx65n_rxdescinit(struct rx65n_ethmac_s *priv);

/* PHY Initialization */

#if defined(CONFIG_NETDEV_PHY_IOCTL) && defined(CONFIG_ARCH_PHY_INTERRUPT)
static void  rx65n_phyintenable(bool enable);
#endif
#if defined(CONFIG_ARCH_PHY_INTERRUPT)
int arch_phy_irq(const char *intf, xcpt_t handler, void *arg,
                 phy_enable_t *enable);
#endif
static int  rx65n_phyinit(struct rx65n_ethmac_s *priv);

/* MAC/DMA Initialization */

static int  rx65n_ethreset(struct rx65n_ethmac_s *priv);
static int  rx65n_macconfig(struct rx65n_ethmac_s *priv);
static void rx65n_macaddress(struct rx65n_ethmac_s *priv);
static int  rx65n_ethconfig(struct rx65n_ethmac_s *priv);

static void rx65n_phy_preamble(void);
static void rx65n_phy_trans_zto0(void);
static void rx65n_phy_trans_1to0(void);
static void rx65n_phy_reg_set(uint8_t phydevaddr, uint16_t reg_addr,
                              int32_t option);
static void rx65n_phy_reg_write(uint16_t data);
static void rx65n_phy_mii_write1(void);
static void rx65n_phy_mii_write0(void);

void rx65n_ether_enable_icu(void);
void rx65n_power_on_control(void);
void rx65n_ether_set_phy_mode(uint8_t mode);
void rx65n_ether_interrupt_init(void);

static int rx65n_phywrite(uint8_t phydevaddr, uint16_t reg_addr,
                          uint16_t data);
static uint16_t rx65n_phyread(uint8_t phydevaddr, uint16_t reg_addr,
                              uint16_t *value);

void up_enable_irq(int irq);
void up_disable_irq(int irq);

#if defined(CONFIG_ARCH_PHY_INTERRUPT)
struct phylinknotification_t
{
  xcpt_t phandler;
  void *penable;
  struct phy_notify_s *pclient;
};

struct phylinknotification_t phylinknotification =
{
  NULL, NULL, NULL
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: rx65n_getreg
 *
 * Description:
 *   This function may to used to intercept an monitor all register accesses.
 *   Clearly this is nothing you would want to do unless you are debugging
 *   this driver.
 *
 * Input Parameters:
 *   addr - The register address to read
 *
 * Returned Value:
 *   The value read from the register
 *
 ****************************************************************************/

#ifdef CONFIG_RX65N_EMAC_REGDEBUG
static uint32_t rx65n_getreg(uint32_t addr)
{
  static uint32_t prevaddr = 0;
  static uint32_t preval   = 0;
  static uint32_t count    = 0;

  /* Read the value from the register */

  uint32_t val = getreg32(addr);

  /* Is this the same value that we read from the same register last time?
   * Are we polling the register?  If so, suppress some of the output.
   */

  if (addr == prevaddr && val == preval)
    {
      if (count == 0xffffffff || ++count > 3)
        {
          if (count == 4)
            {
              ninfo("...\n");
            }

          return val;
        }
    }

  /* No this is a new address or value */

  else
    {
      /* Did we print "..." for the previous value? */

