apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
  DEBUGASSERT(priv->dev.d_len > 0 && priv->dev.d_buf != NULL);

  /* Increment statistics */

#if defined(CONFIG_NETDEV_STATISTICS)
  (priv->dev.d_statistics.tx_packets)++;
#endif

#if OPTIMAL_ETH_BUFSIZE > CONFIG_RX65N_ETH_BUFSIZE
  if (priv->dev.d_len > CONFIG_RX65N_ETH_BUFSIZE)
    {
      /* Yes... how many buffers will be need to send the packet? */

      bufcount = (priv->dev.d_len +
                 (CONFIG_RX65N_ETH_BUFSIZE - 1)) / CONFIG_RX65N_ETH_BUFSIZE;
      lastsize = priv->dev.d_len - (bufcount - 1) * CONFIG_RX65N_ETH_BUFSIZE;

      ninfo("bufcount: %d lastsize: %d\n", bufcount, lastsize);

      /* Set the first segment bit in the first TX descriptor */

      txdesc->tdes0 |= TFP1;

      /* Set up all but the last TX descriptor */

      buffer = priv->dev.d_buf;

      for (i = 0; i < bufcount; i++)
        {
          /* This could be a normal event but the design does not handle it */

          DEBUGASSERT((txdesc->tdes0 & TACT) == 0);

          /* Set the Buffer1 address pointer */

          txdesc->tdes2 = (uint32_t)buffer;

          /* Set the buffer size in all TX descriptors */

          if (i == (bufcount - 1))
            {
              /* This is the last segment.  Set the last segment bit in the
               * last TX descriptor and ask for an interrupt when this
               * segment transfer completes.
               */

              txdesc->tdes0 |= (TFP0 | TWBI);

              /* This segment is, most likely, of fractional buffersize */

              txdesc->tdes1  = (lastsize << 16);
              buffer        += lastsize;
            }
          else
            {
              /* This is not the last segment.  We don't want an interrupt
               * when this segment transfer completes.
               */

              txdesc->tdes0 &= ~TWBI;

              /* The size of the transfer is the whole buffer */

              txdesc->tdes1  = (CONFIG_RX65N_ETH_BUFSIZE << 16);
              buffer        += CONFIG_RX65N_ETH_BUFSIZE;
            }

          /* Give the descriptor to DMA */

          txdesc->tdes0 |= TACT;
          regval  = rx65n_getreg(RX65N_ETHD_EDTRR);
          regval |= (ETHD_EDRRR_TR);
          rx65n_putreg(regval, RX65N_ETHD_EDTRR);

          txdesc = (struct eth_txdesc_s *)txdesc->tdes3;
        }
    }
  else
#endif
    {
      /* The single descriptor is both the first and last segment.  And we do
       * want an interrupt when the transfer completes.
       */

      txdesc->tdes0 |= (TFP0 | TFP1 | TWBI);

      /* Set frame size */

      DEBUGASSERT(priv->dev.d_len <= CONFIG_NET_ETH_PKTSIZE);
      txdesc->tdes1 = ((priv->dev.d_len) << 16);

      /* Set the Buffer1 address pointer */

      txdesc->tdes2 = (uint32_t)priv->dev.d_buf;

      /* Set OWN bit of the TX descriptor tdes0.  This gives the buffer to
       * Ethernet DMA
       */

      txdesc->tdes0 |= TACT;
      regval  = rx65n_getreg(RX65N_ETHD_EDTRR);
      regval |= (ETHD_EDRRR_TR);
      rx65n_putreg(regval, RX65N_ETHD_EDTRR);

      /* Point to the next available TX descriptor */

      txdesc = (struct eth_txdesc_s *)txdesc->tdes3;
    }

  /* Remember where we left off in the TX descriptor chain */

  priv->txhead = txdesc;

  /* Detach the buffer from priv->dev structure.  That buffer is now
   * "in-flight".
   */

  priv->dev.d_buf = NULL;
  priv->dev.d_len = 0;

  /* If there is no other TX buffer, in flight, then remember the location
   * of the TX descriptor.  This is the location to check for TX done events.
   */

  if (!priv->txtail)
    {
      DEBUGASSERT(priv->inflight == 0);
      priv->txtail = txfirst;
    }

  /* Increment the number of TX transfer in-flight */

  priv->inflight++;

  ninfo("txhead: %p txtail: %p inflight: %d\n",
        priv->txhead, priv->txtail, priv->inflight);

  /* If all TX descriptors are in-flight, then we
   * have to disable receive interrupts
   * too.  This is because receive events
   * can trigger more un-stoppable transmit
   * events.
   */

  if (priv->inflight >= CONFIG_RX65N_ETH_NTXDESC)
    {
      rx65n_disableint(priv, ETHD_EESIPR_FRIP);
    }

  /* Enable TX interrupts */

  rx65n_enableint(priv, ETHD_EESIPR_TCIP);

  /* Setup the TX timeout (perhaps restarting the timer) */

  rx65n_cmtw0_start(rx65n_cmtw0_timeout,
                    RX65N_CMTW0_COUNT_VALUE_FOR_TXTIMEOUT);
  return OK;
}

/****************************************************************************
 * Function: rx65n_txpoll
 *
 * Description:
 *   The transmitter is available, check if the network
 *   has any outgoing packets ready
 *   to send.  This is a callback from devif_poll().
 *    devif_poll() may be called:
 *
 *   1. When the preceding TX packet send is complete,
 *   2. When the preceding TX packet send timesout and the interface is reset
 *   3. During normal TX polling
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   OK on success; a negated errno on failure
 *
 * Assumptions:
 *   May or may not be called from an interrupt handler.  In either case,
 *   global interrupts are disabled, either explicitly or indirectly through
 *   interrupt handling logic.
 *
 ****************************************************************************/

static int rx65n_txpoll(struct net_driver_s *dev)
{
  struct rx65n_ethmac_s *priv = (struct rx65n_ethmac_s *)dev->d_private;

  DEBUGASSERT(priv->dev.d_buf != NULL);

  /* Send the packet */

  rx65n_transmit(priv);
  DEBUGASSERT(dev->d_len == 0 && dev->d_buf == NULL);

  /* Check if the next TX descriptor is owned by the Ethernet DMA or
   * CPU. We cannot perform the TX poll if we are unable to accept
   * another packet for transmission.
   *
   * In a race condition, TACT may be cleared BUT still not available
   * because rx65n_freeframe() has not yet run. If rx65n_freeframe()
   * has run, the buffer1 pointer (tdes2) will be nullified (and
   * inflight should be CONFIG_RX65N_ETH_NTXDESC).
   */

  if ((priv->txhead->tdes0 & TACT) != 0 ||
       priv->txhead->tdes2 != 0)
    {
      /* We have to terminate the poll if we have no more descriptors
       * available for another transfer.
       */

      return -EBUSY;
    }

  /* We have the descriptor, we can continue the poll. Allocate a new
   * buffer for the poll.
   */

  dev->d_buf = rx65n_allocbuffer(priv);

  /* We can't continue the poll if we have no buffers */

