apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
  if (dev->d_buf == NULL)
    {
      /* Terminate the poll. */

      return -ENOMEM;
    }

  /* If zero is returned, the polling will continue until all connections
   * have been examined.
   */

  return 0;
}

/****************************************************************************
 * Function: rx65n_dopoll
 *
 * Description:
 *   The function is called in order to perform an out-of-sequence TX poll.
 *   This is done:
 *
 *   1. After completion of a transmission (rx65n_txdone),
 *   2. When new TX data is available (rx65n_txavail_process), and
 *   3. After a TX timeout to restart the sending process
 *      (rx65n_txtimeout_process).
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by interrupt handling logic.
 *
 ****************************************************************************/

static void rx65n_dopoll(struct rx65n_ethmac_s *priv)
{
  struct net_driver_s *dev = &priv->dev;

  /* Check if the next TX descriptor is owned by the Ethernet DMA or
   * CPU.  We cannot perform the TX poll if we are unable to accept
   * another packet for transmission.
   *
   * In a race condition, TACT may be cleared BUT still not available
   * because rx65n_freeframe() has not yet run. If rx65n_freeframe()
   * has run, the buffer1 pointer (tdes2) will be nullified (and
   * inflight should be < CONFIG_RX65N_ETH_NTXDESC).
   */

  if ((priv->txhead->tdes0 & TACT) == 0 &&
       priv->txhead->tdes2 == 0)
    {
      /* If we have the descriptor, then poll the network for new XMIT data.
       * Allocate a buffer for the poll.
       */

      DEBUGASSERT(dev->d_len == 0 && dev->d_buf == NULL);
      dev->d_buf = rx65n_allocbuffer(priv);

      /* We can't poll if we have no buffers */

      if (dev->d_buf)
        {
          devif_poll(dev, rx65n_txpoll);

          /* We will, most likely end up with a buffer to be freed.  But it
           * might not be the same one that we allocated above.
           */

          if (dev->d_buf)
            {
              DEBUGASSERT(dev->d_len == 0);
              rx65n_freebuffer(priv, dev->d_buf);
              dev->d_buf = NULL;
            }
        }
    }
}

/****************************************************************************
 * Function: rx65n_enableint
 *
 * Description:
 *   Enable interrupt
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 ****************************************************************************/

static void rx65n_enableint(struct rx65n_ethmac_s *priv, uint32_t ierbit)
{
  uint32_t regval;

  /* ETHERC/EDMAC enabling Status Interrupt */

  regval  = rx65n_getreg(RX65N_ETHD_EESIPR);
  regval |= (ierbit); /* enabling ETHD_EESIPR_FRIP or ETHD_EESIPR_TCIP */

  rx65n_putreg(regval, RX65N_ETHD_EESIPR);
}

/****************************************************************************
 * Function: rx65n_disableint
 *
 * Description:
 *   Disable a normal interrupt.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 ****************************************************************************/

static void rx65n_disableint(struct rx65n_ethmac_s *priv,
                             uint32_t ierbit)
{
  uint32_t regval;

  /* ETHERC status interrupt request is disabled */

  regval  = rx65n_getreg(RX65N_ETHD_EESIPR);
  regval &= (~(ierbit)); /* setting ETHD_EESIPR_FRIP or ETHD_EESIPR_TCIP */

  rx65n_putreg(regval, RX65N_ETHD_EESIPR);
}

/****************************************************************************
 * Function: rx65n_freesegment
 *
 * Description:
 *   The function is called when a frame is received using the DMA receive
 *   interrupt.  It scans the RX descriptors to the received frame.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by interrupt handling logic.
 *
 ****************************************************************************/

static void rx65n_freesegment(struct rx65n_ethmac_s *priv,
                              struct eth_rxdesc_s *rxfirst, int segments)
{
  struct eth_rxdesc_s *rxdesc;
  int i;
  uint32_t regval;

  ninfo("rxfirst: %p segments: %d\n", rxfirst, segments);

  /* Set RACT bit in RX descriptors.  This gives the buffers back to EDMA */

  rxdesc = rxfirst;
  for (i = 0; i < segments; i++)
    {
      /* Check last descriptor */

      if (rxdesc->rdes0 & RDLE)
        {
          rxdesc->rdes0 |= RACT;
        }
      else
        {
          rxdesc->rdes0 = RACT;
        }

      rxdesc = (struct eth_rxdesc_s *)rxdesc->rdes3;
    }

  /* Resume transmission if stopped */

  if (!(rx65n_getreg(RX65N_ETHD_EDRRR)))
    {
      regval  = rx65n_getreg(RX65N_ETHD_EDRRR);
      regval |= (ETHD_EDRRR_RR);
      rx65n_putreg(regval, RX65N_ETHD_EDRRR);
    }

  /* Reset the segment management logic */

  priv->rxcurr   = NULL;
  priv->segments = 0;
}

/****************************************************************************
 * Function: rx65n_recvframe
 *
 * Description:
 *   The function is called when a frame is received using the DMA receive
 *   interrupt.  It scans the RX descriptors of the received frame.
 *
 *   NOTE: This function will silently discard any packets containing errors.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   OK if a packet was successfully returned; -EAGAIN if there are no
 *   further packets available
 *
 * Assumptions:
 *   Global interrupts are disabled by interrupt handling logic.
 *
 ****************************************************************************/

static int rx65n_recvframe(struct rx65n_ethmac_s *priv)
{
  struct eth_rxdesc_s *rxdesc;
  struct eth_rxdesc_s *rxcurr;
  uint8_t *buffer;
  int i;

  ninfo("rxhead: %p rxcurr: %p segments: %d\n",
        priv->rxhead, priv->rxcurr, priv->segments);

