apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
  ethsr  = rx65n_getreg(RX65N_ETH_ECSR);
  ethsr  &= rx65n_getreg(RX65N_ETH_ECSIPR);
  if ((ethsr & ETH_ECSR_LCHNG) != 0)
    {
      regval  = rx65n_getreg(RX65N_ETH_ECSR);
      regval |= ((ETH_ECSR_LCHNG)); /* Write 1 to clear flag */
      rx65n_putreg(regval, RX65N_ETH_ECSR);

#if defined(CONFIG_ARCH_PHY_INTERRUPT)
    phyreg_read_status = rx65n_phyread(CONFIG_RX65N_EMAC0_PHYADDR,
                                         PHY_STS_READ_REG, &phyreg);
      if (OK == phyreg_read_status)
        {
          regval = (uint32_t)(phyreg & PHY_STS_BIT_MASK)
                    >> PHY_STS_SHIFT_COUNT;
        }

      if (regval != priv->prevlinkstatus) /* Check link status by 0th bit */
        {
          /* Link UP or DOWN status */

          if (phylinknotification.phandler != NULL)
            {
              phylinknotification.phandler(irqno, NULL,
                                           phylinknotification.pclient);
              priv->prevlinkstatus = regval;
            }
        }
#endif
    }

  /* Get the interrupt status bits (ETHERC/EDMAC interrupt status check ) */

  edmasr = rx65n_getreg(RX65N_ETHD_EESR);

  /* Mask only enabled interrupts.  This depends on the
   * fact that the interrupt
   * related bits (0-16) correspond in these two registers.
   */

  edmasr &= rx65n_getreg(RX65N_ETHD_EESIPR);

  /* Yes.. Check if we received an incoming packet,
   * if so, call
   * rx65n_receive()
   */

  if ((edmasr & ETHD_EESR_FR) != 0)
    {
      /* Clear the pending receive interrupt */

      rx65n_putreg(ETHD_EESR_FR, RX65N_ETHD_EESR);

      /* Handle the received package */

      rx65n_receive(priv);
    }

  /* Check if a packet transmission just completed.
   * If so, call rx65n_txdone(). This may disable further
   * TX interrupts if there are no pending transmissions.
   */

  if ((edmasr & ETHD_EESR_TC) != 0)
    {
      /* Clear the pending transmit interrupt */

      rx65n_putreg(ETHD_EESR_TC, RX65N_ETHD_EESR);

      /* Increment statistics */

#if defined(CONFIG_NETDEV_STATISTICS)
  (priv->dev.d_statistics.tx_done)++;
#endif

      /* Check if there are pending transmissions */

      rx65n_txdone(priv);
    }

  net_unlock();

  /* Re-enable Ethernet interrupts */

  up_enable_irq(RX65N_ETH_IRQ);
}

/****************************************************************************
 * Function: rx65n_interrupt
 *
 * Description:
 *   Hardware interrupt handler
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info (architecture-specific)
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *
 ****************************************************************************/

static int rx65n_interrupt(int irq, void *context, void *arg)
{
  struct rx65n_ethmac_s *priv = &g_rx65nethmac[0];
  uint32_t edmasr;

  /* Get the interrupt status bits (ETHERC/EDMAC interrupt status check ) */

  edmasr = rx65n_getreg(RX65N_ETHD_EESR);
  if (edmasr != 0)
    {
      /* Disable further Ethernet interrupts.  Because Ethernet interrupts
       * are also disabled if the TX timeout event occurs, there can be no
       * race condition here.
       */

      up_disable_irq(RX65N_ETH_IRQ);

      /* Check if a packet transmission just completed. */

      if ((edmasr & ETHD_EESR_TC) != 0)
        {
          /* If a TX transfer just completed, then cancel the TX timeout so
           * there will be no race condition between any subsequent timeout
           * expiration and the deferred interrupt processing.
           */

          rx65n_cmtw0_stop(rx65n_cmtw0_timeout);
        }

      /* Schedule to perform the interrupt processing on the worker thread. */

      work_queue(ETHWORK, &priv->irqwork, rx65n_interrupt_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Function: rx65n_txtimeout_work
 *
 * Description:
 *   Perform TX timeout related work from the worker thread
 *
 * Input Parameters:
 *   arg - The argument passed when work_queue() as called.
 *
 * Returned Value:
 *   OK on success
 *
 * Assumptions:
 *   Ethernet interrupts are disabled
 *
 ****************************************************************************/

static void rx65n_txtimeout_work(void *arg)
{
  struct rx65n_ethmac_s *priv = (struct rx65n_ethmac_s *)arg;

  /* Reset the hardware.Just take the interface down, then back up again. */

  net_lock();

  /* Increment statistics */

#if defined(CONFIG_NETDEV_STATISTICS)
  (priv->dev.d_statistics.tx_errors)++;
  (priv->dev.d_statistics.tx_timeouts)++;
#endif

  rx65n_ifdown(&priv->dev);
  rx65n_ifup(&priv->dev);

  /* Then poll for new XMIT data */

  rx65n_dopoll(priv);
  net_unlock();
}

/****************************************************************************
 * Function: rx65n_txtimeout_expiry
 *
 * Description:
 *   Our TX watchdog timed out.  Called from the timer interrupt handler.
 *   The last TX never completed.  Reset the hardware and start again.
 *
 * Input Parameters:
 *   arg  - The argument
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Global interrupts are disabled by the watchdog logic.
 *
 ****************************************************************************/

void rx65n_txtimeout_expiry(wdparm_t arg)
{
  struct rx65n_ethmac_s *priv = (struct rx65n_ethmac_s *)arg;
  nerr("ERROR: Timeout!\n");

  /* Disable further Ethernet interrupts.  This will prevent some race
   * conditions with interrupt work.  There is still a potential race
   * condition with interrupt work that is already queued and in progress.
   *
   * Interrupts will be re-enabled when rx65n_ifup() is called.
   */

  up_disable_irq(RX65N_ETH_IRQ);

  /* Schedule to perform the TX timeout processing on the worker thread,
   * perhaps canceling any pending IRQ processing.
   */

  work_queue(ETHWORK, &priv->irqwork, rx65n_txtimeout_work, priv, 0);
}

/****************************************************************************
 * Function: rx65n_ifup
 *
 * Description:
 *   NuttX Callback: Bring up the Ethernet interface when an IP address is
 *   provided
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   Zero is returned on success; a negated errno value is returned on any
 *   failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int rx65n_ifup(struct net_driver_s *dev)
{
  struct rx65n_ethmac_s *priv = (struct rx65n_ethmac_s *)dev->d_private;
  int ret;

