apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
#ifdef CONFIG_NET_IPv4
  ninfo("Bringing up: %u.%u.%u.%u\n",
        ip4_addr1(dev->d_ipaddr), ip4_addr2(dev->d_ipaddr),
        ip4_addr3(dev->d_ipaddr), ip4_addr4(dev->d_ipaddr));
#endif
#ifdef CONFIG_NET_IPv6
  ninfo("Bringing up: %04x:%04x:%04x:%04x:%04x:%04x:%04x:%04x\n",
        dev->d_ipv6addr[0], dev->d_ipv6addr[1], dev->d_ipv6addr[2],
        dev->d_ipv6addr[3], dev->d_ipv6addr[4], dev->d_ipv6addr[5],
        dev->d_ipv6addr[6], dev->d_ipv6addr[7]);
#endif

  /* Configure the Ethernet interface for DMA operation. */

  ret = rx65n_ethconfig(priv);
  if (ret < 0)
    {
      return ret;
    }

  priv->ifup = true;

  /* Enable the Ethernet interrupt */

  up_enable_irq(RX65N_ETH_IRQ);

  priv->prevlinkstatus = ETHER_LINKUP;
  rx65n_checksetup();

  netdev_carrier_on(dev);

  return OK;
}

/****************************************************************************
 * Function: rx65n_ifdown
 *
 * Description:
 *   NuttX Callback: Stop the interface.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   Returns zero on success; a negated errno value is returned on any
 *   failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int rx65n_ifdown(struct net_driver_s *dev)
{
  struct rx65n_ethmac_s *priv = (struct rx65n_ethmac_s *)dev->d_private;
  irqstate_t flags;
  int ret = OK;
  ninfo("Taking the network down\n");
  flags = spin_lock_irqsave(&priv->lock);

  /* Disable the Ethernet interrupt */

  up_disable_irq(RX65N_ETH_IRQ);

  /* Cancel the TX timeout timers */

  rx65n_cmtw0_stop(rx65n_cmtw0_timeout);

  /* Put the EMAC in its reset, non-operational state.
   * This should be a known configuration that will guarantee
   * the rx65n_ifup() always successfully brings the interface back up.
   */

  ret = rx65n_ethreset(priv);
  if (ret < 0)
    {
      nerr("ERROR: rx65n_ethreset failed (timeout), "
           "still assuming it's going down.\n");
    }

  /* Mark the device "down" */

  priv->ifup = false;

  priv->prevlinkstatus = ETHER_LINKDOWN;

  spin_unlock_irqrestore(&priv->lock, flags);

  netdev_carrier_off(dev);

  return ret;
}

/****************************************************************************
 * Function: rx65n_txavail_work
 *
 * Description:
 *   Perform an out-of-cycle poll on the worker thread.
 *
 * Input Parameters:
 *   arg  - Reference to the NuttX driver state structure (cast to void*)
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called on the higher priority worker thread.
 *
 ****************************************************************************/

static void rx65n_txavail_work(void *arg)
{
  struct rx65n_ethmac_s *priv = (struct rx65n_ethmac_s *)arg;

  ninfo("ifup: %d\n", priv->ifup);

  /* Ignore the notification if the interface is not yet up */

  net_lock();
  if (priv->ifup)
    {
      /* Poll the network for new XMIT data */

      rx65n_dopoll(priv);
    }

  net_unlock();
}

/****************************************************************************
 * Function: rx65n_txavail
 *
 * Description:
 *   Driver callback invoked when new TX data is available.  This is a
 *   stimulus perform an out-of-cycle poll and, thereby, reduce the TX
 *   latency.
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called in normal user mode
 *
 ****************************************************************************/

static int rx65n_txavail(struct net_driver_s *dev)
{
  struct rx65n_ethmac_s *priv = (struct rx65n_ethmac_s *)dev->d_private;

  /* Is our single work structure available?
   * It may not be if there are
   * pending interrupt actions and we will have to ignore the Tx
   * availability action.
   */

  if (work_available(&priv->pollwork))
    {
      /* Schedule to serialize the poll on the worker thread. */

      work_queue(ETHWORK, &priv->pollwork, rx65n_txavail_work, priv, 0);
    }

  return OK;
}

/****************************************************************************
 * Function: rx65n_addmac
 *
 * Description:
 *   NuttX Callback: Add the specified MAC address to the hardware multicast
 *   address filtering
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be added
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

#if defined(CONFIG_NET_MCASTGROUP) || defined(CONFIG_NET_ICMPv6)
static int rx65n_addmac(struct net_driver_s *dev, const uint8_t *mac)
{
  ninfo("MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
        mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  /* RX65N do not support add on mac multi cast feature because related
   * hash table mac multi cast register is not supported in RX65N.
   */

  return OK;
}
#endif /* CONFIG_NET_MCASTGROUP || CONFIG_NET_ICMPv6 */

/****************************************************************************
 * Function: rx65n_rmmac
 *
 * Description:
 *   NuttX Callback: Remove the specified MAC address from the
 *   hardware multicast
 *   address filtering
 *
 * Input Parameters:
 *   dev  - Reference to the NuttX driver state structure
 *   mac  - The MAC address to be removed
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

#ifdef CONFIG_NET_MCASTGROUP
static int rx65n_rmmac(struct net_driver_s *dev, const uint8_t *mac)
{
  ninfo("MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
        mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);

  /* RX65N do not support add on mac multi cast feature because related
   * hash table multi cast mac register not available. This function is
   * not need to implement.
   */

  return OK;
}
#endif

/****************************************************************************
 * Function: rx65n_txdescinit
 *
 * Description:
 *   Initializes the DMA TX descriptors in chain mode.
 *
 * Input Parameters:
 *   priv  - Reference to the driver state structure
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *
 ****************************************************************************/

static void rx65n_txdescinit(struct rx65n_ethmac_s *priv)
{
  struct eth_txdesc_s *txdesc;
  int i;

  /* priv->txhead will point to the first, available TX descriptor in
   * the chain.
   * Set the priv->txhead pointer to the first descriptor in the table.
   */

  priv->txhead = priv->txtable;

  /* priv->txtail will point to the first segment
   * of the oldest pending "in-flight" TX transfer.
   * NULL means that there are no active TX transfers.
   */

  priv->txtail   = NULL;
  priv->inflight = 0;

