apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
  flags = spin_lock_irqsave(&g_rx65nethmac[0].lock);
  rx65n_phyintenable(false);

  /* Configure the interrupt */

  if (handler)
    {
      phylinknotification.phandler = handler;
      phylinknotification.penable = enable;
      phylinknotification.pclient = arg;
      enabler  = rx65n_phyintenable;
    }
  else
    {
      phylinknotification.phandler = NULL;
      phylinknotification.penable = NULL;
      phylinknotification.pclient = NULL;
      enabler = NULL;
    }

  /* Return the enabling function pointer */

  if (enable)
    {
      *enable = enabler;
    }

  /* Return the old handler (so that it can be restored) */

  spin_unlock_irqrestore(&g_rx65nethmac[0].lock, flags);
  return OK;
}
#endif

/****************************************************************************
 * Function Name: phy_start_autonegotiate
 * Description  : Starts auto-negotiate
 * Arguments    : pause -
 *                    Using state of pause frames
 * Return Value : none
 ****************************************************************************/

void phy_start_autonegotiate(uint8_t pause)
{
  volatile uint16_t regval = 0;

  /* Set local ability */

  /* When pause frame is not used */

  if (ETHER_FLAG_OFF == pause)
    {
      regval = ((((PHY_AN_ADVERTISEMENT_100F |
                   PHY_AN_ADVERTISEMENT_100H) |
                   PHY_AN_ADVERTISEMENT_10F) |
                   PHY_AN_ADVERTISEMENT_10H) |
                   PHY_AN_ADVERTISEMENT_SELECTOR);
    }

  /* When pause frame is used */

  else
    {
      regval = ((((((PHY_AN_ADVERTISEMENT_ASM_DIR |
                     PHY_AN_ADVERTISEMENT_PAUSE) |
                     PHY_AN_ADVERTISEMENT_100F) |
                     PHY_AN_ADVERTISEMENT_100H) |
                     PHY_AN_ADVERTISEMENT_10F) |
                     PHY_AN_ADVERTISEMENT_10H) |
                     PHY_AN_ADVERTISEMENT_SELECTOR);
    }

  /* Configure what the PHY and the Ethernet controller on this board
   * supports
   */

  rx65n_phywrite(CONFIG_RX65N_EMAC0_PHYADDR,
                           PHY_REG_AN_ADVERTISEMENT, regval);
  rx65n_phywrite(CONFIG_RX65N_EMAC0_PHYADDR, PHY_REG_CONTROL,
                      (PHY_CONTROL_AN_ENABLE | PHY_CONTROL_AN_RESTART));
}

/****************************************************************************
 * Function Name: rx65n_power_on_control
 * Description  : Powers on the channel if the ETHEC channel
 *                used and the PHY access channel are different, or if the
 *                PHY access channel is powered off.
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

void rx65n_power_on_control(void)
{
  uint8_t regval = 0;

  /* Enable writing to registers related to operating modes, LPC, CGC and
   * software reset
   */

  SYSTEM.PRCR.WORD = 0xa50bu;

  /* Enable writing to MSTP registers. */

  regval  = getreg8(RX65N_MPC_PWPR);
  regval &= (~(1 << 7)); /* Clearing the PWPR register B0WI bit */
  putreg8(regval, RX65N_MPC_PWPR);
  regval  = getreg8(RX65N_MPC_PWPR);
  regval |= (1 << 6); /* Enabling the PWPR registers PFSWE bit */
  putreg8(regval, RX65N_MPC_PWPR);

  /* Enable selected ETHERC/EDMAC Channel. */

  regval  = rx65n_getreg(RX65N_MSTP_CRB);
  regval &= (~(1 << 15)); /* Clearing the MSTPB bit in MSTPCRB to release from module stop state */
  rx65n_putreg(regval, RX65N_MSTP_CRB);

  /* Disable writing to MSTP registers. */

  regval  = getreg8(RX65N_MPC_PWPR);
  regval &= (~(1 << 7)); /* Clearing the PWPR register B0WI bit */
  putreg8(regval, RX65N_MPC_PWPR);
  regval  = getreg8(RX65N_MPC_PWPR);
  regval &= (~(1 << 6)); /* Clear the PWPR registers PFSWE bit */
  putreg8(regval, RX65N_MPC_PWPR);
  regval  = getreg8(RX65N_MPC_PWPR);
  regval |= (1 << 7); /* Enable the PWPR register B0WI bit */
  putreg8(regval, RX65N_MPC_PWPR);

  /* Enable protection */

  SYSTEM.PRCR.WORD = 0xa500u;
}

/****************************************************************************
 * Function Name: rx65n_ether_set_phy_mode
 * Description  : Set port connect for Mode selection
 * Arguments    : mode -
 *                    phy mode
 * Return Value : none
 ****************************************************************************/

void rx65n_ether_set_phy_mode(uint8_t mode)
{
  if (PHY_MII_SET_MODE == mode)
    {
      /* MII */

      /* PFENET -> PHYMODE0 is Enabled Ethernet Channel0 to use MII Mode; */

      putreg8(ETH_PFENET_MII_MODE, RX65N_MPC_PFENET);
    }
  else if (PHY_RMII_SET_MODE == mode)
    {
      /* RMII */

      /* PFENET -> PHYMODE0 is Enabled Ethernet Channel0 to use MII Mode; */

      putreg8(ETH_PFENET_RMII_MODE, RX65N_MPC_PFENET);
    }
  else
    {
      /* By Default MII will be selected */

      /* PFENET -> PHYMODE0 is Enabled Ethernet Channel0 to use MII Mode; */

      putreg8(ETH_PFENET_MII_MODE, RX65N_MPC_PFENET);
    }
}

/****************************************************************************
 * Function Name: phy_reg_read
 * Description  : Reads PHY register through MII interface
 * Arguments    : pdata -
 *                    pointer to store the data read
 * Return Value : none
 ****************************************************************************/

static void phy_reg_read(uint16_t *pdata)
{
  int32_t databitcnt = 0;
  int32_t j;
  uint16_t reg_data;

  /* The processing of DATA (data) about reading of the frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5" of
   * "IEEE 802.3-2008_section2".
   */

  reg_data = 0;
  databitcnt = 16; /* Number of bit to read */

  while (databitcnt > 0) /* reading 1 bit per loop */
    {
      for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
        {
          /* Reset All Flags of PIR */

          rx65n_putreg(ETH_PIR_RESET_ALL, RX65N_ETH_PIR);
        }

      for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
        {
          /* Setting MDC of PIR */

          rx65n_putreg(ETH_PIR_SET_MDC, RX65N_ETH_PIR);
        }

      reg_data <<= 1;

      /* MDI read  */

      reg_data |= (uint16_t) (((rx65n_getreg(RX65N_ETH_PIR))
                                                  & ETH_PIR_MDI) >> 3);

