apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
      for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
        {
          /* Setting MDC of PIR */

          rx65n_putreg(ETH_PIR_SET_MDC, RX65N_ETH_PIR);
        }

      for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
        {
          rx65n_putreg(ETH_PIR_RESET_ALL, RX65N_ETH_PIR); /* Reset All Flags of PIR */
        }

      databitcnt--;
    }

  (*pdata) = reg_data;
}

/****************************************************************************
 * Function Name: rx65n_phyread
 * Description  : Reads a PHY register
 * Arguments    : phydevaddr -
 *                    Phy address
 *                reg_addr -
 *                    address of the PHY register
 * Return Value : read value
 ****************************************************************************/

static uint16_t rx65n_phyread(uint8_t phydevaddr, uint16_t reg_addr,
                              uint16_t *value)
{
  uint16_t data;

  /* The value is read from the PHY register by the frame format
   * of MII Management Interface provided
   * for by Table 22-12 of 22.2.4.5 of
   * IEEE 802.3-2008_section2.
   */

  rx65n_phy_preamble();
  rx65n_phy_reg_set(phydevaddr, reg_addr, PHY_MII_READ);
  rx65n_phy_trans_zto0();
  phy_reg_read(&data);
  rx65n_phy_trans_zto0();
  *value = data;
  return OK;
}

/****************************************************************************
 * Function Name: rx65n_ether_enable_icu
 * Description  :
 * Arguments    :
 * Return Value : none
 ****************************************************************************/

void rx65n_ether_enable_icu(void)
{
  uint32_t ipl;

  /* Enabling EDMAC0 interrupt request using AL1 group interrupt */

  ICU.GENAL1.BIT.EN4 = 1;

  /* Priority to this interrupt should be value 2 */

  ipl = ETHER_CFG_AL1_INT_PRIORITY;

  /* Disable group interrupts */

  IEN(ICU, GROUPAL1) = 0;

  /* Clear interrupt flag */

  IR(ICU, GROUPAL1)  = 0;

  /* Set priority level */

  IPR(ICU, GROUPAL1) = (uint8_t)
                       (ipl > IPR(ICU, GROUPAL1) ? ipl : IPR(ICU, GROUPAL1));

  /* Enable group BL0 interrupt */

  IEN(ICU, GROUPAL1) = 1;
}

/****************************************************************************
 * Function Name: rx65n_phy_trans_zto0
 * Description  : Performs bus release so that PHY can drive data
 *              : for read operation
 * Arguments    : ether_channel -
 *                    Ethernet channel number
 * Return Value : none
 ****************************************************************************/

static void rx65n_phy_trans_zto0(void)
{
  int32_t j;

  /* The processing of TA (turnaround) about reading of the frame format of
   * MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5" of "IEEE 802.3-2008_section2".
   */

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
          /* Resetting All flags of PIR */

      rx65n_putreg(ETH_PIR_RESET_ALL, RX65N_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      rx65n_putreg(ETH_PIR_SET_MDC, RX65N_ETH_PIR); /* Setting MDC of PIR */
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      rx65n_putreg(ETH_PIR_SET_MDC, RX65N_ETH_PIR); /* Setting MDC of PIR */
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Resetting All flags of PIR */

      rx65n_putreg(ETH_PIR_RESET_ALL, RX65N_ETH_PIR);
    }
}

/****************************************************************************
 * Function Name: rx65n_phy_trans_1to0
 * Description  : Switches data bus so MII interface can drive data
 *              : for write operation
 * Arguments    : ether_channel -
 *                    Ethernet channel number
 * Return Value : none
 ****************************************************************************/

static void rx65n_phy_trans_1to0(void)
{
  /* The processing of TA (turnaround) about writing of the frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5" of "IEEE 802.3-2008_section2".
   */

  rx65n_phy_mii_write1();
  rx65n_phy_mii_write0();
}

/****************************************************************************
 * Function Name: rx65n_phy_reg_set
 * Description  : Sets a PHY device to read or write mode
 * Arguments    : phydevaddr -
 *                    Phy address
 *                reg_addr -
 *                    address of the PHY register
 *                option -
 *                    mode
 * Return Value : none
 ****************************************************************************/

static void rx65n_phy_reg_set(uint8_t phydevaddr, uint16_t reg_addr,
                              int32_t option)
{
  int32_t bitcnt = 0;
  uint16_t data;

  /* The processing of ST (start of frame),
   * OP (operation code), PHYAD (PHY Address), and
   * REGAD (Register Address)  about the frame format of
   * MII Management Interface which is
   * provided by "Table 22-12" of
   * "22.2.4.5" of "IEEE 802.3-2008_section2".
   */

  data = 0;
  data = (PHY_MII_ST << 14); /* ST code    */
  if (PHY_MII_READ == option)
    {
      data |= (PHY_MII_READ << 12); /* OP code(RD)  */
    }
  else
    {
      data |= (PHY_MII_WRITE << 12); /* OP code(WR)  */
    }

  data |= (uint16_t) (phydevaddr << 7); /* PHY Address configured 0x1e  in decimal 30 */
  data |= (reg_addr << 2);
  bitcnt = 14;  /* These number of bits to send for ST, OP, PHYAD and REGAD */
  while (bitcnt > 0)
    {
      if (0 == (data & 0x8000))
        {
          rx65n_phy_mii_write0();
        }
      else
        {
          rx65n_phy_mii_write1();
        }

      data <<= 1;
      bitcnt--;
    }
}

/****************************************************************************
 * Function Name: rx65n_phy_reg_write
 * Description  : Writes to PHY register through MII interface
 * Arguments    :  data -
 *                value to write
 * Return Value : none
 ****************************************************************************/

static void rx65n_phy_reg_write(uint16_t data)
{
  int32_t databitcnt = 0;

  /* The processing of DATA (data) about writing of the frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5"
   * of "IEEE 802.3-2008_section2".
   */

  databitcnt = 16;       /* Number of bit to write */
  while (databitcnt > 0) /* writing 1 bit per loop */
    {
      if (0 == (data & 0x8000))
        {
          rx65n_phy_mii_write0();
        }
      else
        {
          rx65n_phy_mii_write1();
        }

      databitcnt--;
      data <<= 1;
    }
}

/****************************************************************************
 * Function Name: rx65n_phy_mii_write1
 * Description  : Outputs 1 to the MII interface
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

static void rx65n_phy_mii_write1(void)
{
  int32_t j;

  /* The processing of one bit about frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5"
   * of "IEEE 802.3-2008_section2".
   * The data that 1 is output.
   */

