apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDO and MMD and by default MDI */

       rx65n_putreg(ETH_PIR_SET_MDO_MMD, RX65N_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDO, MMD and MDC and by default MDI */

      rx65n_putreg(ETH_PIR_SET_MDO_MMD_MDC, RX65N_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDO, MMD and MDC and by default MDI */

      rx65n_putreg(ETH_PIR_SET_MDO_MMD_MDC, RX65N_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDO and MMD and by default MDI */

      rx65n_putreg(ETH_PIR_SET_MDO_MMD, RX65N_ETH_PIR);
    }
}

/****************************************************************************
 * Function Name: rx65n_phy_mii_write0
 * Description  : Outputs 0 to the MII interface
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

static void rx65n_phy_mii_write0(void)
{
  int32_t j;

  /* The processing of one bit about frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5" of "IEEE 802.3-2008_section2".
   * The data that 0 is output.
   */

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MMD and by default MDI */

      rx65n_putreg(ETH_PIR_SET_MMD, RX65N_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDC and MMD and by default MDI */

      rx65n_putreg(ETH_PIR_SET_MMD_MDC, RX65N_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MDC and MMD and by default MDI */

      rx65n_putreg(ETH_PIR_SET_MMD_MDC, RX65N_ETH_PIR);
    }

  for (j = ETHER_CFG_PHY_MII_WAIT; j > 0; j--)
    {
      /* Setting MMD and by default MDI */

      rx65n_putreg(ETH_PIR_SET_MMD, RX65N_ETH_PIR);
    }
}

/****************************************************************************
 * Function Name: rx65n_phy_preamble
 * Description  : As preliminary preparation for access
 *                to the PHY module register,
 *                "1" is output via the MII management interface.
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

static void rx65n_phy_preamble(void)
{
  int16_t preamble_bits = 0;

  /* The processing of PRE (preamble) about the frame format
   * of MII Management Interface which is
   * provided by "Table 22-12" of "22.2.4.5"
   * of "IEEE 802.3-2008_section2".
   */

  /* Send 32 consecutive 1's as per 34.3.4.1
   * MII/RMII Management Frame Format
   */

  preamble_bits = 32;
  while (preamble_bits > 0)
    {
      rx65n_phy_mii_write1();
      preamble_bits--;
    }
}

/****************************************************************************
 * Function Name: rx65n_phywrite
 * Description  : Writes to a PHY register
 * Arguments    : phydevaddr -
 *                    Phy device address
 *                reg_addr -
 *                    address of the PHY register
 *                data -
 *                    value
 * Return Value : none
 ****************************************************************************/

static int rx65n_phywrite (uint8_t phydevaddr, uint16_t reg_addr,
                           uint16_t data)
{
  /* The value is read from the PHY register by the frame format
   * of MII Management Interface provided
   * for by Table 22-12 of 22.2.4.5 of IEEE 802.3-2008_section2.
   */

  rx65n_phy_preamble();
  rx65n_phy_reg_set(phydevaddr, reg_addr, PHY_MII_WRITE);
  rx65n_phy_trans_1to0();
  rx65n_phy_reg_write(data);
  rx65n_phy_trans_zto0();
  return OK;
}

/****************************************************************************
 * Function Name: rx65n_ether_interrupt_init
 * Description  : Writes to a ETHERC/EDMAC register
 * Arguments    : none
 * Return Value : none
 ****************************************************************************/

void rx65n_ether_interrupt_init(void)
{
  uint32_t regval;

  /* Start interrupt control unit for ethernet interrupt */

  rx65n_ether_enable_icu();

  /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */

  rx65n_putreg(ETH_ECSR_CLR, RX65N_ETH_ECSR);

  /* Clear all EDMAC status bits */

  rx65n_putreg(ETHD_EESR_EDMAC, RX65N_ETHD_EESR);

  /* Notification of ET0_LINKSTA signal change interrupt is disabled. */

  regval  = rx65n_getreg(RX65N_ETH_ECSIPR);
  regval &= (~(ETH_ECSIPR_LCHNGIP));
  rx65n_putreg(regval, RX65N_ETH_ECSIPR);

  /* ETHERC status interrupt request is disabled */

  regval  = rx65n_getreg(RX65N_ETHD_EESIPR);
  regval &= (~(ETHD_EESIPR_ECIIP));
  rx65n_putreg(regval, RX65N_ETHD_EESIPR);
}

/****************************************************************************
 * Function: rx65n_phyinit
 *
 * Description:
 *  Configure the PHY and determine the link speed/duplex.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int rx65n_phyinit(struct rx65n_ethmac_s *priv)
{
  uint32_t count;
  uint16_t reg;
  int ret;
  count = 0;

#ifdef CONFIG_RX65N_EMAC0_AUTONEG
  /*  Software Reset the PHY */

    ret = rx65n_phywrite(CONFIG_RX65N_EMAC0_PHYADDR,
                         PHY_REG_CONTROL, PHY_CONTROL_RESET);

  /* Reset completion waiting */

  do
    {
      ret = rx65n_phyread(CONFIG_RX65N_EMAC0_PHYADDR,
                          PHY_REG_CONTROL, &reg);
      count++;
    }
  while ((reg & PHY_CONTROL_RESET) && (count < ETHER_CFG_PHY_DELAY_RESET));

  if (count > ETHER_CFG_PHY_DELAY_RESET)
    {
      return -ETIMEDOUT;
    }

  priv->mbps100 = 0;
  priv->fduplex = 0;

  /* Initialize the PHY Auto negotiation with frame pause disable */

  phy_start_autonegotiate (PAUSE_FRAME_DISABLE);

  /* Interrupt initialization */

  rx65n_ether_interrupt_init();

  /* To check the Link status in PHY registers read Auto-negotiation
   * Advertisement register
   */

  ret = rx65n_phyread(CONFIG_RX65N_EMAC0_PHYADDR, PHY_REG_STATUS, &reg);

