apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
  count = 0;
  do
    {
      /* Reading PHY status register after negotiation */

      ret = rx65n_phyread(CONFIG_RX65N_EMAC0_PHYADDR, PHY_REG_STATUS, &reg);
      count++;
    }
  while ((!((reg & (PHY_VALID_LINK | PHY_AUTO_NEG_DONE))
                         || (count > ETHER_PHY_STATUS_CHECK_DELAY))));

  if (count > ETHER_PHY_STATUS_CHECK_DELAY)
    {
      return -ETIMEDOUT;
    }

#ifdef CONFIG_RX65N_EMAC0_PHYSR_ALTCONFIG
  ret = rx65n_phyread(CONFIG_RX65N_EMAC0_PHYADDR, PHY_STS_REG, &reg);
  switch (reg & CONFIG_RX65N_EMAC0_PHYSR_ALTMODE)
    {
      default:
      case CONFIG_RX65N_EMAC0_PHYSR_10HD:
        priv->fduplex = 0;
        priv->mbps100 = 0;
        break;

      case CONFIG_RX65N_EMAC0_PHYSR_100HD:
        priv->fduplex = 0;
        priv->mbps100 = 1;
        break;

      case CONFIG_RX65N_EMAC0_PHYSR_10FD:
        priv->fduplex = 1;
        priv->mbps100 = 0;
        break;

      case CONFIG_RX65N_EMAC0_PHYSR_100FD:
        priv->fduplex = 1;
        priv->mbps100 = 1;
        break;
    }
#endif
#endif

  return ret;
}

/****************************************************************************
 * Function: rx65n_ethreset
 *
 * Description:
 *  Reset the Ethernet block.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   Zero on success, or a negated errno value on any failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int rx65n_ethreset(struct rx65n_ethmac_s *priv)
{
  uint32_t regval;
  uint32_t retries;

  /* Notification of ET0_LINKSTA signal change interrupt is disabled. */

  regval  = rx65n_getreg(RX65N_ETH_ECSIPR);
  regval &= (~(ETH_ECSIPR_LCHNGIP));
  rx65n_putreg(regval, RX65N_ETH_ECSIPR);

  regval  = rx65n_getreg(RX65N_ETHD_EESIPR);
  regval &= (~(ETHD_EESIPR_ECIIP));
  rx65n_putreg(regval, RX65N_ETHD_EESIPR);

  /* Disable TE and RE in ECMR Register */

  /* rx65n_putreg(ETH_ECMR_CLR, RX65N_ETH_ECMR); */

  regval  = rx65n_getreg(RX65N_ETH_ECMR);
  regval &= (~(ETH_ECMR_TE | ETH_ECMR_RE));
  rx65n_putreg(regval, RX65N_ETH_ECMR);

  /* Perform a software reset by setting the SWR bit in the EDMR register.
   * When 1 is written, the EDMAC and ETHERC are reset
   */

  /* Registers TDLAR, RDLAR, RMFCR TFUCR and RFOCR are not reset */

  regval  = rx65n_getreg(RX65N_ETHD_EDMR);
  regval |= ETHD_EDMR_SWR;
  rx65n_putreg(regval, RX65N_ETHD_EDMR);

  /* Wait for software reset to complete. The SR bit is cleared automatically
   * after the reset operation has completed in all of the core clock
   * domains.
   */

  retries = 10;
  while (((rx65n_getreg(RX65N_ETHD_EDMR) & ETHD_EDMR_SWR) != 0) &&
         retries > 0)
    {
      retries--;
      up_mdelay(10);
    }

  if (retries == 0)
    {
      return -ETIMEDOUT;
    }

  /* Notification of ET0_LINKSTA signal change interrupt is disabled. */

  regval  = rx65n_getreg(RX65N_ETH_ECSIPR);
  regval |= (ETH_ECSIPR_LCHNGIP);
  rx65n_putreg(regval, RX65N_ETH_ECSIPR);

  regval  = rx65n_getreg(RX65N_ETHD_EESIPR);
  regval |= (ETHD_EESIPR_ECIIP);
  rx65n_putreg(regval, RX65N_ETHD_EESIPR);

  return 0;
}

/****************************************************************************
 * Function: rx65n_macconfig
 *
 * Description:
 *  Configure the Ethernet MAC for DMA operation.
 *  Software reset has to be executed, and ETHERC and EDMAC are configured.
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int rx65n_macconfig(struct rx65n_ethmac_s *priv)
{
  uint32_t regval;
  uint32_t retries;

  /* Perform a software reset by setting the SWR bit in the EDMR register.
   * When 1 is written, the EDMAC and ETHERC are reset
   */

  /* Registers TDLAR, RDLAR, RMFCR TFUCR and RFOCR are not reset */

  regval  = rx65n_getreg(RX65N_ETHD_EDMR);
  regval |= ETHD_EDMR_SWR;
  rx65n_putreg(regval, RX65N_ETHD_EDMR);

  retries = 10;
  while (((rx65n_getreg(RX65N_ETHD_EDMR) & ETHD_EDMR_SWR) != 0) &&
         retries > 0)
    {
      retries--;
      up_mdelay(10);
    }

  /* Notification of ET0_LINKSTA signal change interrupt is disabled. */

  regval  = rx65n_getreg(RX65N_ETH_ECSIPR);
  regval |= (ETH_ECSIPR_LCHNGIP);
  rx65n_putreg(regval, RX65N_ETH_ECSIPR);

  regval  = rx65n_getreg(RX65N_ETHD_EESIPR);
  regval |= (ETHD_EESIPR_ECIIP);
  rx65n_putreg(regval, RX65N_ETHD_EESIPR);

  rx65n_macaddress(priv);

  return OK;
}

/****************************************************************************
 * Function: rx65n_macaddress
 *
 * Description:
 *   Configure the selected MAC address.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static void rx65n_macaddress(struct rx65n_ethmac_s *priv)
{
  struct net_driver_s *dev = &priv->dev;
  uint32_t regval;
  regval = 0;

  ninfo("%s MAC: %02x:%02x:%02x:%02x:%02x:%02x\n",
        dev->d_ifname,
        dev->d_mac.ether.ether_addr_octet[0],
                     dev->d_mac.ether.ether_addr_octet[1],
        dev->d_mac.ether.ether_addr_octet[2],
                     dev->d_mac.ether.ether_addr_octet[3],
        dev->d_mac.ether.ether_addr_octet[4],
                    dev->d_mac.ether.ether_addr_octet[5]);

  /* Set the MAC address high register */

  regval = (((((uint32_t) dev->d_mac.ether.ether_addr_octet[0] << 24) |
              ((uint32_t) dev->d_mac.ether.ether_addr_octet[1] << 16))
           | ((uint32_t) dev->d_mac.ether.ether_addr_octet[2] << 8)) |
                   (uint32_t) dev->d_mac.ether.ether_addr_octet[3]);
  rx65n_putreg(regval, RX65N_ETH_MAHR);

  /* Set the MAC address low register */

  regval = 0;
  regval = (((uint32_t) dev->d_mac.ether.ether_addr_octet[4] << 8) |
             (uint32_t)dev->d_mac.ether.ether_addr_octet[5]);
  rx65n_putreg(regval, RX65N_ETH_MALR);
}

/****************************************************************************
 * Function: rx65n_ethconfig
 *
 * Description:
 *  Configure the Ethernet interface for operation.
 *
 * Input Parameters:
 *   priv - A reference to the private driver state structure
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *
 ****************************************************************************/

static int rx65n_ethconfig(struct rx65n_ethmac_s *priv)
{
  int ret;
  uint32_t regval;

  /* Reset the Ethernet block */

  ninfo("Reset the Ethernet block\n");
  ret = rx65n_ethreset(priv);
  if (ret < 0)
    {
      nerr("ERROR: Reset of Ethernet block failed\n");
      return ret;
    }

  /* Initialize the PHY selection Set port connect
   * Currently we are using MII
   */

