apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
  rx65n_ether_set_phy_mode(PHY_SET_MODE_REG);

  /* ETHERC/EDMAC Power on */

  rx65n_power_on_control();

  /* Initialize the PHY */

  ninfo("Initialize the PHY\n");
  ret = rx65n_phyinit(priv);
  if (ret < 0)
    {
      return ret;
    }

  /* Initialize the MAC and Ethernet DMA */

  ninfo("Initialize the MAC and DMA\n");
  ret = rx65n_macconfig(priv);
  if (ret < 0)
    {
      return ret;
    }

#ifndef CONFIG_ENDIAN_BIG

  /* Set little endian mode */

  regval  = rx65n_getreg(RX65N_ETHD_EDMR);
  regval |= ETHD_EDMR_DE;
  rx65n_putreg(regval, RX65N_ETHD_EDMR);
#endif

  /* Initialize the free buffer list */

  rx65n_initbuffer(priv);

  /* Initialize TX Descriptors list: Chain Mode */

  rx65n_txdescinit(priv);

  /* Initialize RX Descriptors list: Chain Mode  */

  rx65n_rxdescinit(priv);

  /* Clear all ETHERC status BFR, PSRTO, LCHNG, MPD, ICD */

  rx65n_putreg(ETH_ECSR_CLR, RX65N_ETH_ECSR);

  /* Clear all EDMAC status bits */

  rx65n_putreg(ETHD_EESR_EDMAC, RX65N_ETHD_EESR);

  /* Interrupt configuration */

  /* Notification of ET0_LINKSTA signal change interrupt */

  regval  = rx65n_getreg(RX65N_ETH_ECSR);
  regval |= ((ETH_ECSR_LCHNG)); /* Write 1 to clear flag */
  rx65n_putreg(regval, RX65N_ETH_ECSR);
  regval  = rx65n_getreg(RX65N_ETH_ECSIPR);
  regval |= ((ETH_ECSIPR_LCHNGIP));
  rx65n_putreg(regval, RX65N_ETH_ECSIPR);

  /* ETHERC/EDMAC enabling Status Interrupt */

  regval  = rx65n_getreg(RX65N_ETHD_EESIPR);
  regval |= ((ETHD_EESIPR_ECIIP));
  rx65n_putreg(regval, RX65N_ETHD_EESIPR);

  /* Ethernet length 1514bytes + CRC and */

  rx65n_putreg(ETH_RFLR_RFL, RX65N_ETH_RFLR);

  /* Intergap is 96-bit time */

  rx65n_putreg(ETH_IPGR_IPG_INITIAL, RX65N_ETH_IPGR);

  /* Continuous reception number of Broadcast frame */

  regval  = rx65n_getreg(RX65N_ETH_BCFRR);
  regval |= (ETH_BCFRR_BCF);
  rx65n_putreg(regval, RX65N_ETH_BCFRR);

  regval  = rx65n_getreg(RX65N_ETHD_TRSCER);
  if (ETHER_MC_FILTER_ON == priv->mc_filter_flag)
    {
  /* Reflect the EESR.RMAF bit status in the RD0.RFS bit
   * in the receive descriptor
   */

      regval &= (~((ETHD_TRSCER_RMAFCE) | (ETHD_TRSCER_RRFCE)));
      rx65n_putreg(regval, RX65N_ETHD_TRSCER);
    }
  else
    {
  /* Don't reflect the EESR.RMAF bit status in the RD0.RFS
   * bit in the receive descriptor
   */

      regval &= (~(ETHD_TRSCER_RRFCE));
      regval |= (ETHD_TRSCER_RMAFCE);
      rx65n_putreg(regval, RX65N_ETHD_TRSCER);
    }

  /* Threshold of Tx_FIFO */

  rx65n_putreg(ETHD_TFTR_TFT, RX65N_ETHD_TFTR); /* Store and forward mode */

  /* transmit fifo is 1968 bytes & receive fifo is 2048 bytes */

  regval  = rx65n_getreg(RX65N_ETHD_FDR);
  regval |= ((ETHD_FDR_RFD) | (ETHD_FDR_TFD));
  rx65n_putreg(regval, RX65N_ETHD_FDR);

  /* Configure receiving method */

  /* b0      RNR - Receive Request Bit Reset - Continuous reception
   * of multiple frames is possible.
   * b31:b1  Reserved set to 0
   */

  regval  = rx65n_getreg(RX65N_ETHD_RMCR);
  regval |= (ETHD_RMCR_RNR);
  rx65n_putreg(regval, RX65N_ETHD_RMCR);

  /* Transmit Interrupt Setting */

  regval  = rx65n_getreg(RX65N_ETHD_TRIMD);
  regval |= ((ETHD_TRIMD_TIS) | (ETHD_TRIMD_TIM));
  rx65n_putreg(regval, RX65N_ETHD_TRIMD);

  /* ETHERC/EDMAC enabling Interrupt */

  regval  = rx65n_getreg(RX65N_ETHD_EESIPR);
  regval |= ((ETHD_EESIPR_TCIP) | (ETHD_EESIPR_FRIP) | (ETHD_EESIPR_ECIIP));
  rx65n_putreg(regval, RX65N_ETHD_EESIPR);

  regval  = rx65n_getreg(RX65N_ETH_ECSIPR);
  regval |= ((ETH_ECSIPR_LCHNGIP));
  rx65n_putreg(regval, RX65N_ETH_ECSIPR);

  /* Enabling TE and RE and set DM mode  */

  regval  = rx65n_getreg(RX65N_ETH_ECMR);
  regval  |= ETH_ECMR_RE;
  regval  |= ETH_ECMR_TE;
  if (priv->fduplex)
    {
      regval  |= ETH_ECMR_DM;
    }
  else
    {
      regval  &= (~ETH_ECMR_DM);
    }

  if (priv->mbps100)
    {
      regval  |= ETH_ECMR_RTM;
    }
  else
    {
      regval  &= (~ETH_ECMR_RTM);
    }

  rx65n_putreg(regval, RX65N_ETH_ECMR);

  /* Start DMA reception */

  regval  = rx65n_getreg(RX65N_ETHD_EDRRR);
  regval |= (ETHD_EDRRR_RR);
  rx65n_putreg(regval, RX65N_ETHD_EDRRR);

  return ret;
}

/****************************************************************************
 * Function: rx65n_ethinitialize
 *
 * Description:
 *   Initialize the EMAC driver.
 *
 * Input Parameters:
 *   intf - If multiple EMAC peripherals are supported, this identifies the
 *     the EMAC peripheral being initialized.
 *
 * Returned Value:
 *   OK on success; Negated errno on failure.
 *
 * Assumptions:
 *   Called very early in the initialization sequence.
 *
 ****************************************************************************/

int rx65n_ethinitialize(int intf)
{
  struct rx65n_ethmac_s *priv;
  int ret;
  uint32_t reg32;

  /* Initialize hardware mac address */

  uint8_t mac[6];
  mac[0] = RX65N_MAC_ADDRL & 0xff;
  mac[1] = (RX65N_MAC_ADDRL & 0xff00) >> 8;
  mac[2] = (RX65N_MAC_ADDRL & 0xff0000) >> 16;
  mac[3] = (RX65N_MAC_ADDRL & 0xff000000) >> 24;
  mac[4] = RX65N_MAC_ADDRH & 0xff;
  mac[5] = (RX65N_MAC_ADDRH & 0xff00) >> 8;

  ninfo("intf: %d\n", intf);

  /* Get the interface structure associated with this interface number. */

  DEBUGASSERT(intf < RX65N_NETHERNET);

  priv = &g_rx65nethmac[intf];

  /* Initialize the driver structure */

  memset(priv, 0, sizeof(struct rx65n_ethmac_s));

  /* I/F up (new IP address) callback */

  priv->dev.d_ifup    = rx65n_ifup;

  /* I/F down callback */

  priv->dev.d_ifdown  = rx65n_ifdown;
  priv->dev.d_txavail = rx65n_txavail;  /* New TX data callback */
#ifdef CONFIG_NET_MCASTGROUP
  priv->dev.d_addmac  = rx65n_addmac;   /* Add multicast MAC address */
  priv->dev.d_rmmac   = rx65n_rmmac;    /* Remove multicast MAC address */
#endif
#ifdef CONFIG_NETDEV_IOCTL
  priv->dev.d_ioctl   = rx65n_ioctl;    /* Support PHY ioctl() calls */
#endif

  /* Used to recover private state from dev */

  priv->dev.d_private = g_rx65nethmac;

  /* Multi cast flag */

  priv->mc_filter_flag = ETHER_MC_FILTER_OFF;

  /* hw mac address */

  priv->dev.d_mac.ether.ether_addr_octet[0] =  mac[0];
  priv->dev.d_mac.ether.ether_addr_octet[1] =  mac[1];
  priv->dev.d_mac.ether.ether_addr_octet[2] =  mac[2];
  priv->dev.d_mac.ether.ether_addr_octet[3] =  mac[3];
  priv->dev.d_mac.ether.ether_addr_octet[4] =  mac[4];
  priv->dev.d_mac.ether.ether_addr_octet[5] =  mac[5];

  /* Enable write to System registers */

