apache/nuttx/arch/renesas/src/rx65n/rx65n_eth.c
  putreg16(RX65N_PRCR_VALUE, RX65N_PRCR_ADDR);

  /* Start CMT module */

  reg32 = getreg32(RX65N_MSTPCRA_ADDR);

  /* Release CMTW unit1 from module stop state(for CMTW1) */

  reg32 &= (~RX65N_CMTW_UNIT1_MSTPCRA_STOP);

  /* Release CMTW unit1 from module stop state(for CMTW0) */

  reg32 &= (~RX65N_CMTW_UNIT0_MSTPCRA_STOP);
  putreg32(reg32, RX65N_MSTPCRA_ADDR);

  /* Create timer for timing polling for and timing of transmissions */

  rx65n_cmtw0_create(RX65N_CMTW0_COUNT_VALUE_FOR_TXPOLL ,
                     RX65N_CMTW0_COUNT_VALUE_FOR_TXTIMEOUT);

  spin_lock_init(&priv->lock);

  /* Attach the IRQ to the driver */

  if (irq_attach(RX65N_ETH_IRQ, rx65n_interrupt, NULL))
    {
      /* We could not attach the ISR to the interrupt */

      return -EAGAIN;
    }

  /* Put the interface in the down state. */

  ret = rx65n_ifdown(&priv->dev);
  if (ret < 0)
    {
      nerr("ERROR: Initialization of Ethernet block failed: %d\n", ret);
      return ret;
    }

  /* Register the device with the OS so that socket IOCTLs can be performed */

  netdev_register(&priv->dev, NET_LL_ETHERNET);
  return OK;
}

/****************************************************************************
 * Function: renesas_netinitialize
 *
 * Description:
 *   This is the "standard" network initialization logic called from the
 *   low-level initialization logic in up_initialize.c.  If RX65N_NETHERNET
 *   greater than one, then board specific logic will have to supply a
 *   version of renesas_netinitialize() that calls rx65n_ethinitialize() with
 *   the appropriate interface number.
 *
 * Input Parameters:
 *   None.
 *
 * Returned Value:
 *   None.
 *
 * Assumptions:
 *
 ****************************************************************************/

#if defined (CONFIG_NET) && !defined(CONFIG_NETDEV_LATEINIT)
void renesas_netinitialize(void)
{
  int ret;

#if defined(CONFIG_RX65N_EMAC0)

  /* Initialize the EMAC0 driver */

  ret = rx65n_ethinitialize(EMAC0_INTF);
  if (ret < 0)
    {
      nerr("ERROR: up_emac_initialize(EMAC0) failed: %d\n", ret);
    }
#endif
}
#endif
#endif /* RX65N_NETHERNET > 0 */
#endif /* CONFIG_NET && CONFIG_RX65N_EMAC */
